{
    "bio": [
        "I am a biosound artist, educator, and researcher working at the intersection of art, science, technology, and biology. My work is driven by a deep fascination with the hidden connections between living organisms and human perception. By transforming biological processes into immersive audiovisual experiences, I aim to reveal the rhythms, behaviors, and unseen forms of communication that animate the natural world.",
        "With a background in biochemistry and programming, I merge scientific inquiry and technological experimentation to create hybrid, experimental artworks. My practice often centers around plant intelligence and microbial symbiosis, exploring how living systems interact and communicate. I design custom-built biointerfaces and generative systems that translate biochemical signals into soundscapes and visual compositions, offering new ways to connect with the environment.",
        "One of my signature projects, Biocode: Music of the Plants, uses real-time data from plants to generate algorithmic sound compositions. Through this work, I emphasize the beauty and complexity of symbiotic relationships, celebrating community and interdependence as essential aspects of life and creation.",
        "My performances and installations bring together sound art, live coding, and biotechnological processes to create collaborative acts between organisms, algorithms, and machines. By amplifying bioelectric or biochemical signals from plants, microbes, or other organisms, I reimagine communication in the living world, making the invisible audible and tangible. These projects challenge the boundaries between the organic and the artificial, inviting audiences to rethink their relationships with nature and technology.",
        "Over the years, I’ve had the privilege of presenting my work at festivals, exhibitions, and performances worldwide. My passion for education drives me to share these ideas through workshops and experimental science initiatives for audiences of all ages. By blending creativity, curiosity, and ecological awareness, I seek to inspire new ways of perceiving the connections between art, biology, and technology. Ultimately, my goal is to develop a shared language that bridges disciplines, allowing us to see nature as an active collaborator and a source of endless artistic inspiration."
    ],
    "biopic":"https://live.staticflickr.com/65535/54530571325_e9ba759d0a_b.jpg"
}